#Python - Non-technical introduction

##SOLUTION Exercise Day 4 Session 3 "No data, no problem: How to simulate data?"

This file provides the solutions to the exercises.

*Note:* If you want to make changes to this document, you need to save your own copy using the "Save copy in Drive" command in the "File" menu.

###Preparation

**Make sure to run the follwing code before continuing.** Code will prepare everything (load data, ...).

In [ ]:
#load the numpy package
import numpy as np
#load the Pandas package
import pandas as pd
#load the itertools package
import itertools

###38 - Creating sequences automatically

1. Simulate a dataset with 100 customers. The ID column should include customer IDs from `a1` to `a100`. Further, this dataset should include a second column indicating the months of 2016 for every customer. Months should be of the format `"2016-01-01"`("YYYY-MM-DD"). The final table should have one record per customer per month.

In [ ]:
n_cust=100
CustData=pd.DataFrame({"CustId":range(1,n_cust+1)})
CustData.head(n=3)

   CustId
0       1
1       2
2       3

In [ ]:
CustData["CustId"] = "a" + CustData["CustId"].astype(str)
CustData.head(n=3)

  CustId
0     a1
1     a2
2     a3

In [ ]:
import itertools
monthly_dates=pd.date_range(start='1/1/2016',end='12/31/2016', freq="MS")
CustData=pd.DataFrame((list(itertools.product(CustData["CustId"], monthly_dates))))
CustData.head(n=20)

     0          1
0   a1 2016-01-01
1   a1 2016-02-01
2   a1 2016-03-01
3   a1 2016-04-01
4   a1 2016-05-01
5   a1 2016-06-01
6   a1 2016-07-01
7   a1 2016-08-01
8   a1 2016-09-01
9   a1 2016-10-01
10  a1 2016-11-01
11  a1 2016-12-01
12  a2 2016-01-01
13  a2 2016-02-01
14  a2 2016-03-01
15  a2 2016-04-01
16  a2 2016-05-01
17  a2 2016-06-01
18  a2 2016-07-01
19  a2 2016-08-01

In [ ]:
CustData.columns = ["CustId", "Months"]
CustData.head()

  CustId     Months
0     a1 2016-01-01
1     a1 2016-02-01
2     a1 2016-03-01
3     a1 2016-04-01
4     a1 2016-05-01

###39 - Simulating and manipulating strings

1. Generate a) a female full name b) a male first name.

In [ ]:
#load the names package
import names

In [ ]:
#a)
names.get_full_name(gender="female")

'Rebecca Taylor'

In [ ]:
#b)
names.get_first_name(gender="male")

'Elmer'

In [ ]:
#c)
names.get_last_name()

'Crump'

###40 - Simulating variables by using distributions

No exercise for this unit.